from django.core.management.base import BaseCommand
from Core.models import Location

class Command(BaseCommand):
    help = 'Заполняет базу данных списком из 30 легендарных локаций'

    def handle(self, *args, **kwargs):
        locations_data = [
            (59.9339, 30.3066, "Исаакиевский собор", "Россия"),
            (55.7539, 37.6208, "Красная площадь", "Россия"),
            (56.3287, 44.0017, "Набережная Волги", "Россия"),
            (43.1167, 131.9000, "Сопка Орлиное гнездо", "Россия"),
            (44.4528, 34.0578, "Смотровая площадка на Ай-Петри", "Крым"),
            (62.2148, 59.3042, "Столбы выветривания, Маньпупунёр", "Россия"),
            (53.4383, 107.7083, "Озеро Байкал, мыс Хобой", "Россия"),
            (54.4925, 160.0333, "Долина гейзеров", "Россия"),
            (69.5000, 93.0000, "Плато Путорана", "Россия"),
            (61.1000, 127.4000, "Ленские столбы", "Россия"),
            (48.8588, 2.2945, "Эйфелева башня", "Франция"),
            (41.8902, 12.4922, "Колизей", "Италия"),
            (37.9715, 23.7257, "Акрополь", "Греция"),
            (37.8199, -122.4783, "Мост Золотые Ворота", "США"),
            (13.1631, -72.5450, "Мачу-Пикчу", "Перу"),
            (36.1068, -112.1128, "Большой каньон", "США"),
            (43.0828, -79.0714, "Ниагарский водопад", "Канада/США"),
            (29.9792, 31.1342, "Пирамиды Гизы", "Египет"),
            (27.1750, 78.0419, "Тадж-Махал", "Индия"),
            (13.4125, 103.8667, "Ангкор-Ват", "Камбоджа"),
            (40.2833, 116.0000, "Великая Китайская стена", "Китай"),
            (34.9672, 135.7736, "Храм Фусими Инари", "Япония"),
            (-33.8568, 151.2153, "Сиднейский оперный театр", "Австралия"),
            (35.3606, 138.7272, "Гора Фудзи", "Япония"),
            (30.3286, 35.4419, "Петра", "Иордания"),
            (-17.9244, 25.8570, "Водопад Виктория", "Замбия/Зимбабве"),
            (-20.1964, -67.5739, "Салар де Уюни", "Боливия"),
            (-33.9583, 18.4239, "Столовая гора", "ЮАР"),
            (44.080326, 40.007785, "Плато Лаго-Наки", "Россия"),
            (44.083423, 40.005106, "Скала Утюг", "Россия"),
        ]

        created_count = 0
        for lat, lon, name, country in locations_data:
            # Используем get_or_create, чтобы не дублировать точки при повторном запуске
            obj, created = Location.objects.get_or_create(
                lat=lat,
                lon=lon,
                defaults={
                    'name': name,
                    'country': country,
                    'is_game_task': True
                }
            )
            if created:
                created_count += 1

        self.stdout.write(self.style.SUCCESS(f'Успешно добавлено {created_count} новых локаций!'))
